Revit 2027 API
ParameterTypeId.ContinuousrailProfileTypeParam Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailProfileTypeParam { get; }
Public Shared ReadOnly Property ContinuousrailProfileTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailProfileTypeParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailProfileTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace